[
  {
    "pageContent": "Corn (Zea mays) requires specific soil conditions for optimal growth. The ideal soil pH range is between 6.0 and 6.8. The soil should be well-draining but capable of retaining enough moisture and nutrients to support growth throughout the season.",
    "metadata": {
      "source": "https://agriculture.com/corn/soil-requirements",
      "topic": "soil-requirements",
      "crop": "corn"
    }
  },
  {
    "pageContent": "Planting time for corn is crucial for successful yields. Plant when soil temperatures reach at least 50°F (10°C) at a 2-inch depth. In most regions, this occurs in spring, typically between April and May. Plant depth should be between 1.5 to 2 inches in heavy soils and 2.5 inches in lighter soils.",
    "metadata": {
      "source": "https://agriculture.com/corn/planting-guide",
      "topic": "planting",
      "crop": "corn"
    }
  },
  {
    "pageContent": "Corn requires significant nitrogen throughout its growth cycle. Apply 25-30% of total nitrogen needs at planting, and the remainder when plants are 6-8 inches tall. Total nitrogen requirements typically range from 130-180 pounds per acre depending on yield potential.",
    "metadata": {
      "source": "https://agriculture.com/corn/fertilization",
      "topic": "fertilization",
      "crop": "corn"
    }
  },
  {
    "pageContent": "Water management is critical for corn production. Corn requires approximately 20-30 inches of water per season. The most critical period for irrigation is during silking and grain fill. Water stress during these periods can reduce yields by 3-8% per day of stress.",
    "metadata": {
      "source": "https://agriculture.com/corn/irrigation",
      "topic": "irrigation",
      "crop": "corn"
    }
  },
  {
    "pageContent": "Common corn diseases include Gray Leaf Spot, Northern Corn Leaf Blight, and Common Rust. Prevention strategies include crop rotation, resistant varieties, and timely fungicide applications. Scout fields weekly during the growing season to identify early signs of disease.",
    "metadata": {
      "source": "https://agriculture.com/corn/disease-management",
      "topic": "disease-management",
      "crop": "corn"
    }
  }
]